Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMS70N21.xml
        <register caption="Device Endpoint Enable Register (n = 0) 5" name="USBHS_DEVEPTIER5" offset="0x204" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Enable" mask="0x00000001" name="TXINES"/>
          <bitfield caption="Received OUT Data Interrupt Enable" mask="0x00000002" name="RXOUTES"/>
          <bitfield caption="Received SETUP Interrupt Enable" mask="0x00000004" name="RXSTPES"/>
          <bitfield caption="NAKed OUT Interrupt Enable" mask="0x00000008" name="NAKOUTES"/>
          <bitfield caption="NAKed IN Interrupt Enable" mask="0x00000010" name="NAKINES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFES"/>
          <bitfield caption="STALLed Interrupt Enable" mask="0x00000040" name="STALLEDES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETES"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBKS"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCONS"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Enable" mask="0x00010000" name="EPDISHDMAS"/>
          <bitfield caption="NYET Token Disable Enable" mask="0x00020000" name="NYETDISS"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
          <bitfield caption="STALL Request Enable" mask="0x00080000" name="STALLRQS"/>
        </register>
        <register caption="Device Endpoint Enable Register (n = 0) 6" name="USBHS_DEVEPTIER6" offset="0x208" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Enable" mask="0x00000001" name="TXINES"/>
          <bitfield caption="Received OUT Data Interrupt Enable" mask="0x00000002" name="RXOUTES"/>
          <bitfield caption="Received SETUP Interrupt Enable" mask="0x00000004" name="RXSTPES"/>
          <bitfield caption="NAKed OUT Interrupt Enable" mask="0x00000008" name="NAKOUTES"/>
          <bitfield caption="NAKed IN Interrupt Enable" mask="0x00000010" name="NAKINES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFES"/>
          <bitfield caption="STALLed Interrupt Enable" mask="0x00000040" name="STALLEDES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETES"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBKS"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCONS"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Enable" mask="0x00010000" name="EPDISHDMAS"/>
          <bitfield caption="NYET Token Disable Enable" mask="0x00020000" name="NYETDISS"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
          <bitfield caption="STALL Request Enable" mask="0x00080000" name="STALLRQS"/>
        </register>
        <register caption="Device Endpoint Enable Register (n = 0) 7" name="USBHS_DEVEPTIER7" offset="0x20C" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Enable" mask="0x00000001" name="TXINES"/>
          <bitfield caption="Received OUT Data Interrupt Enable" mask="0x00000002" name="RXOUTES"/>
          <bitfield caption="Received SETUP Interrupt Enable" mask="0x00000004" name="RXSTPES"/>
          <bitfield caption="NAKed OUT Interrupt Enable" mask="0x00000008" name="NAKOUTES"/>
          <bitfield caption="NAKed IN Interrupt Enable" mask="0x00000010" name="NAKINES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFES"/>
          <bitfield caption="STALLed Interrupt Enable" mask="0x00000040" name="STALLEDES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETES"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBKS"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCONS"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Enable" mask="0x00010000" name="EPDISHDMAS"/>
          <bitfield caption="NYET Token Disable Enable" mask="0x00020000" name="NYETDISS"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
          <bitfield caption="STALL Request Enable" mask="0x00080000" name="STALLRQS"/>
        </register>
        <register caption="Device Endpoint Enable Register (n = 0) 8" name="USBHS_DEVEPTIER8" offset="0x210" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Enable" mask="0x00000001" name="TXINES"/>
          <bitfield caption="Received OUT Data Interrupt Enable" mask="0x00000002" name="RXOUTES"/>
          <bitfield caption="Received SETUP Interrupt Enable" mask="0x00000004" name="RXSTPES"/>
          <bitfield caption="NAKed OUT Interrupt Enable" mask="0x00000008" name="NAKOUTES"/>
          <bitfield caption="NAKed IN Interrupt Enable" mask="0x00000010" name="NAKINES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFES"/>
          <bitfield caption="STALLed Interrupt Enable" mask="0x00000040" name="STALLEDES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETES"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBKS"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCONS"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Enable" mask="0x00010000" name="EPDISHDMAS"/>
          <bitfield caption="NYET Token Disable Enable" mask="0x00020000" name="NYETDISS"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
          <bitfield caption="STALL Request Enable" mask="0x00080000" name="STALLRQS"/>
        </register>
        <register caption="Device Endpoint Enable Register (n = 0) 9" name="USBHS_DEVEPTIER9" offset="0x214" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Enable" mask="0x00000001" name="TXINES"/>
          <bitfield caption="Received OUT Data Interrupt Enable" mask="0x00000002" name="RXOUTES"/>
          <bitfield caption="Received SETUP Interrupt Enable" mask="0x00000004" name="RXSTPES"/>
          <bitfield caption="NAKed OUT Interrupt Enable" mask="0x00000008" name="NAKOUTES"/>
          <bitfield caption="NAKed IN Interrupt Enable" mask="0x00000010" name="NAKINES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFES"/>
          <bitfield caption="STALLed Interrupt Enable" mask="0x00000040" name="STALLEDES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETES"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBKS"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCONS"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Enable" mask="0x00010000" name="EPDISHDMAS"/>
          <bitfield caption="NYET Token Disable Enable" mask="0x00020000" name="NYETDISS"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
          <bitfield caption="STALL Request Enable" mask="0x00080000" name="STALLRQS"/>
        </register>
        <register caption="Device Endpoint Disable Register (n = 0) 0" name="USBHS_DEVEPTIDR0" offset="0x220" rw="W" size="4">
          <bitfield caption="Transmitted IN Interrupt Clear" mask="0x00000001" name="TXINEC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTEC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPEC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTEC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINEC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFEC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDEC"/>
          <bitfield caption="Shortpacket Interrupt Clear" mask="0x00000080" name="SHORTPACKETEC"/>
          <bitfield caption="Number of Busy Banks Interrupt Clear" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Clear" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Clear" mask="0x00010000" name="EPDISHDMAC"/>
          <bitfield caption="NYET Token Disable Clear" mask="0x00020000" name="NYETDISC"/>
          <bitfield caption="STALL Request Clear" mask="0x00080000" name="STALLRQC"/>
        </register>
        <register caption="Device Endpoint Disable Register (n = 0) 1" name="USBHS_DEVEPTIDR1" offset="0x224" rw="W" size="4">
          <bitfield caption="Transmitted IN Interrupt Clear" mask="0x00000001" name="TXINEC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTEC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPEC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTEC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINEC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFEC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDEC"/>
          <bitfield caption="Shortpacket Interrupt Clear" mask="0x00000080" name="SHORTPACKETEC"/>
          <bitfield caption="Number of Busy Banks Interrupt Clear" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Clear" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Clear" mask="0x00010000" name="EPDISHDMAC"/>
          <bitfield caption="NYET Token Disable Clear" mask="0x00020000" name="NYETDISC"/>
          <bitfield caption="STALL Request Clear" mask="0x00080000" name="STALLRQC"/>
        </register>
        <register caption="Device Endpoint Disable Register (n = 0) 2" name="USBHS_DEVEPTIDR2" offset="0x228" rw="W" size="4">
          <bitfield caption="Transmitted IN Interrupt Clear" mask="0x00000001" name="TXINEC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTEC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPEC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTEC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINEC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFEC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDEC"/>
          <bitfield caption="Shortpacket Interrupt Clear" mask="0x00000080" name="SHORTPACKETEC"/>
          <bitfield caption="Number of Busy Banks Interrupt Clear" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Clear" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Clear" mask="0x00010000" name="EPDISHDMAC"/>
          <bitfield caption="NYET Token Disable Clear" mask="0x00020000" name="NYETDISC"/>
          <bitfield caption="STALL Request Clear" mask="0x00080000" name="STALLRQC"/>
        </register>
        <register caption="Device Endpoint Disable Register (n = 0) 3" name="USBHS_DEVEPTIDR3" offset="0x22C" rw="W" size="4">
          <bitfield caption="Transmitted IN Interrupt Clear" mask="0x00000001" name="TXINEC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTEC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPEC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTEC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINEC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFEC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDEC"/>
          <bitfield caption="Shortpacket Interrupt Clear" mask="0x00000080" name="SHORTPACKETEC"/>
          <bitfield caption="Number of Busy Banks Interrupt Clear" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Clear" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Clear" mask="0x00010000" name="EPDISHDMAC"/>
          <bitfield caption="NYET Token Disable Clear" mask="0x00020000" name="NYETDISC"/>
          <bitfield caption="STALL Request Clear" mask="0x00080000" name="STALLRQC"/>
        </register>
        <register caption="Device Endpoint Disable Register (n = 0) 4" name="USBHS_DEVEPTIDR4" offset="0x230" rw="W" size="4">
          <bitfield caption="Transmitted IN Interrupt Clear" mask="0x00000001" name="TXINEC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTEC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPEC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTEC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINEC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFEC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDEC"/>
          <bitfield caption="Shortpacket Interrupt Clear" mask="0x00000080" name="SHORTPACKETEC"/>
          <bitfield caption="Number of Busy Banks Interrupt Clear" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Clear" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Clear" mask="0x00010000" name="EPDISHDMAC"/>
          <bitfield caption="NYET Token Disable Clear" mask="0x00020000" name="NYETDISC"/>
          <bitfield caption="STALL Request Clear" mask="0x00080000" name="STALLRQC"/>
        </register>
        <register caption="Device Endpoint Disable Register (n = 0) 5" name="USBHS_DEVEPTIDR5" offset="0x234" rw="W" size="4">
          <bitfield caption="Transmitted IN Interrupt Clear" mask="0x00000001" name="TXINEC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTEC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPEC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTEC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINEC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFEC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDEC"/>
          <bitfield caption="Shortpacket Interrupt Clear" mask="0x00000080" name="SHORTPACKETEC"/>
          <bitfield caption="Number of Busy Banks Interrupt Clear" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Clear" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Clear" mask="0x00010000" name="EPDISHDMAC"/>
          <bitfield caption="NYET Token Disable Clear" mask="0x00020000" name="NYETDISC"/>
          <bitfield caption="STALL Request Clear" mask="0x00080000" name="STALLRQC"/>
        </register>
        <register caption="Device Endpoint Disable Register (n = 0) 6" name="USBHS_DEVEPTIDR6" offset="0x238" rw="W" size="4">
          <bitfield caption="Transmitted IN Interrupt Clear" mask="0x00000001" name="TXINEC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTEC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPEC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTEC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINEC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFEC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDEC"/>
          <bitfield caption="Shortpacket Interrupt Clear" mask="0x00000080" name="SHORTPACKETEC"/>
          <bitfield caption="Number of Busy Banks Interrupt Clear" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Clear" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Clear" mask="0x00010000" name="EPDISHDMAC"/>
          <bitfield caption="NYET Token Disable Clear" mask="0x00020000" name="NYETDISC"/>
          <bitfield caption="STALL Request Clear" mask="0x00080000" name="STALLRQC"/>
        </register>
        <register caption="Device Endpoint Disable Register (n = 0) 7" name="USBHS_DEVEPTIDR7" offset="0x23C" rw="W" size="4">
          <bitfield caption="Transmitted IN Interrupt Clear" mask="0x00000001" name="TXINEC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTEC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPEC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTEC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINEC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFEC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDEC"/>
          <bitfield caption="Shortpacket Interrupt Clear" mask="0x00000080" name="SHORTPACKETEC"/>
          <bitfield caption="Number of Busy Banks Interrupt Clear" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Clear" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Clear" mask="0x00010000" name="EPDISHDMAC"/>
          <bitfield caption="NYET Token Disable Clear" mask="0x00020000" name="NYETDISC"/>
          <bitfield caption="STALL Request Clear" mask="0x00080000" name="STALLRQC"/>
        </register>
        <register caption="Device Endpoint Disable Register (n = 0) 8" name="USBHS_DEVEPTIDR8" offset="0x240" rw="W" size="4">
          <bitfield caption="Transmitted IN Interrupt Clear" mask="0x00000001" name="TXINEC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTEC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPEC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTEC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINEC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFEC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDEC"/>
          <bitfield caption="Shortpacket Interrupt Clear" mask="0x00000080" name="SHORTPACKETEC"/>
          <bitfield caption="Number of Busy Banks Interrupt Clear" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Clear" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Clear" mask="0x00010000" name="EPDISHDMAC"/>
          <bitfield caption="NYET Token Disable Clear" mask="0x00020000" name="NYETDISC"/>
          <bitfield caption="STALL Request Clear" mask="0x00080000" name="STALLRQC"/>
        </register>
        <register caption="Device Endpoint Disable Register (n = 0) 9" name="USBHS_DEVEPTIDR9" offset="0x244" rw="W" size="4">
          <bitfield caption="Transmitted IN Interrupt Clear" mask="0x00000001" name="TXINEC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTEC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPEC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTEC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINEC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFEC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDEC"/>
          <bitfield caption="Shortpacket Interrupt Clear" mask="0x00000080" name="SHORTPACKETEC"/>
          <bitfield caption="Number of Busy Banks Interrupt Clear" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Clear" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Clear" mask="0x00010000" name="EPDISHDMAC"/>
          <bitfield caption="NYET Token Disable Clear" mask="0x00020000" name="NYETDISC"/>
          <bitfield caption="STALL Request Clear" mask="0x00080000" name="STALLRQC"/>
        </register>
        <register caption="Device DMA Channel Next Descriptor Address Register (n = 1)" name="USBHS_DEVDMANXTDSC1" offset="0x310" rw="RW" size="4">
          <bitfield caption="Next Descriptor Address" mask="0xFFFFFFFF" name="NXT_DSC_ADD"/>
        </register>
