Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMS70N21.xml
    <module name="LOCKBIT" version="1">
      <register-group name="LOCKBIT">
        <register caption="Lock Bits Word 0" name="LOCKBIT_WORD0" offset="0x0" rw="RW" size="4">
          <bitfield caption="Lock Region 0" mask="0x00000001" name="LOCK_REGION_0"/>
          <bitfield caption="Lock Region 1" mask="0x00000002" name="LOCK_REGION_1"/>
          <bitfield caption="Lock Region 2" mask="0x00000004" name="LOCK_REGION_2"/>
          <bitfield caption="Lock Region 3" mask="0x00000008" name="LOCK_REGION_3"/>
          <bitfield caption="Lock Region 4" mask="0x00000010" name="LOCK_REGION_4"/>
          <bitfield caption="Lock Region 5" mask="0x00000020" name="LOCK_REGION_5"/>
          <bitfield caption="Lock Region 6" mask="0x00000040" name="LOCK_REGION_6"/>
          <bitfield caption="Lock Region 7" mask="0x00000080" name="LOCK_REGION_7"/>
          <bitfield caption="Lock Region 8" mask="0x00000100" name="LOCK_REGION_8"/>
          <bitfield caption="Lock Region 9" mask="0x00000200" name="LOCK_REGION_9"/>
          <bitfield caption="Lock Region 10" mask="0x00000400" name="LOCK_REGION_10"/>
          <bitfield caption="Lock Region 11" mask="0x00000800" name="LOCK_REGION_11"/>
          <bitfield caption="Lock Region 12" mask="0x00001000" name="LOCK_REGION_12"/>
          <bitfield caption="Lock Region 13" mask="0x00002000" name="LOCK_REGION_13"/>
          <bitfield caption="Lock Region 14" mask="0x00004000" name="LOCK_REGION_14"/>
          <bitfield caption="Lock Region 15" mask="0x00008000" name="LOCK_REGION_15"/>
          <bitfield caption="Lock Region 16" mask="0x00010000" name="LOCK_REGION_16"/>
          <bitfield caption="Lock Region 17" mask="0x00020000" name="LOCK_REGION_17"/>
          <bitfield caption="Lock Region 18" mask="0x00040000" name="LOCK_REGION_18"/>
          <bitfield caption="Lock Region 19" mask="0x00080000" name="LOCK_REGION_19"/>
          <bitfield caption="Lock Region 20" mask="0x00100000" name="LOCK_REGION_20"/>
          <bitfield caption="Lock Region 21" mask="0x00200000" name="LOCK_REGION_21"/>
          <bitfield caption="Lock Region 22" mask="0x00400000" name="LOCK_REGION_22"/>
          <bitfield caption="Lock Region 23" mask="0x00800000" name="LOCK_REGION_23"/>
          <bitfield caption="Lock Region 24" mask="0x01000000" name="LOCK_REGION_24"/>
          <bitfield caption="Lock Region 25" mask="0x02000000" name="LOCK_REGION_25"/>
          <bitfield caption="Lock Region 26" mask="0x04000000" name="LOCK_REGION_26"/>
          <bitfield caption="Lock Region 27" mask="0x08000000" name="LOCK_REGION_27"/>
          <bitfield caption="Lock Region 28" mask="0x10000000" name="LOCK_REGION_28"/>
          <bitfield caption="Lock Region 29" mask="0x20000000" name="LOCK_REGION_29"/>
          <bitfield caption="Lock Region 30" mask="0x40000000" name="LOCK_REGION_30"/>
          <bitfield caption="Lock Region 31" mask="0x80000000" name="LOCK_REGION_31"/>
        </register>
        <register caption="Lock Bits Word 1" name="LOCKBIT_WORD1" offset="0x4" rw="RW" size="4">
          <bitfield caption="Lock Region 32" mask="0x00000001" name="LOCK_REGION_32"/>
          <bitfield caption="Lock Region 33" mask="0x00000002" name="LOCK_REGION_33"/>
          <bitfield caption="Lock Region 34" mask="0x00000004" name="LOCK_REGION_34"/>
          <bitfield caption="Lock Region 35" mask="0x00000008" name="LOCK_REGION_35"/>
          <bitfield caption="Lock Region 36" mask="0x00000010" name="LOCK_REGION_36"/>
          <bitfield caption="Lock Region 37" mask="0x00000020" name="LOCK_REGION_37"/>
          <bitfield caption="Lock Region 38" mask="0x00000040" name="LOCK_REGION_38"/>
          <bitfield caption="Lock Region 39" mask="0x00000080" name="LOCK_REGION_39"/>
          <bitfield caption="Lock Region 40" mask="0x00000100" name="LOCK_REGION_40"/>
          <bitfield caption="Lock Region 41" mask="0x00000200" name="LOCK_REGION_41"/>
          <bitfield caption="Lock Region 42" mask="0x00000400" name="LOCK_REGION_42"/>
          <bitfield caption="Lock Region 43" mask="0x00000800" name="LOCK_REGION_43"/>
          <bitfield caption="Lock Region 44" mask="0x00001000" name="LOCK_REGION_44"/>
          <bitfield caption="Lock Region 45" mask="0x00002000" name="LOCK_REGION_45"/>
          <bitfield caption="Lock Region 46" mask="0x00004000" name="LOCK_REGION_46"/>
          <bitfield caption="Lock Region 47" mask="0x00008000" name="LOCK_REGION_47"/>
          <bitfield caption="Lock Region 48" mask="0x00010000" name="LOCK_REGION_48"/>
          <bitfield caption="Lock Region 49" mask="0x00020000" name="LOCK_REGION_49"/>
          <bitfield caption="Lock Region 50" mask="0x00040000" name="LOCK_REGION_50"/>
          <bitfield caption="Lock Region 51" mask="0x00080000" name="LOCK_REGION_51"/>
          <bitfield caption="Lock Region 52" mask="0x00100000" name="LOCK_REGION_52"/>
          <bitfield caption="Lock Region 53" mask="0x00200000" name="LOCK_REGION_53"/>
          <bitfield caption="Lock Region 54" mask="0x00400000" name="LOCK_REGION_54"/>
          <bitfield caption="Lock Region 55" mask="0x00800000" name="LOCK_REGION_55"/>
          <bitfield caption="Lock Region 56" mask="0x01000000" name="LOCK_REGION_56"/>
          <bitfield caption="Lock Region 57" mask="0x02000000" name="LOCK_REGION_57"/>
          <bitfield caption="Lock Region 58" mask="0x04000000" name="LOCK_REGION_58"/>
          <bitfield caption="Lock Region 59" mask="0x08000000" name="LOCK_REGION_59"/>
          <bitfield caption="Lock Region 60" mask="0x10000000" name="LOCK_REGION_60"/>
          <bitfield caption="Lock Region 61" mask="0x20000000" name="LOCK_REGION_61"/>
          <bitfield caption="Lock Region 62" mask="0x40000000" name="LOCK_REGION_62"/>
          <bitfield caption="Lock Region 63" mask="0x80000000" name="LOCK_REGION_63"/>
        </register>
        <register caption="Lock Bits Word 2" name="LOCKBIT_WORD2" offset="0x8" rw="RW" size="4">
          <bitfield caption="Lock Region 64" mask="0x00000001" name="LOCK_REGION_64"/>
          <bitfield caption="Lock Region 65" mask="0x00000002" name="LOCK_REGION_65"/>
          <bitfield caption="Lock Region 66" mask="0x00000004" name="LOCK_REGION_66"/>
          <bitfield caption="Lock Region 67" mask="0x00000008" name="LOCK_REGION_67"/>
          <bitfield caption="Lock Region 68" mask="0x00000010" name="LOCK_REGION_68"/>
          <bitfield caption="Lock Region 69" mask="0x00000020" name="LOCK_REGION_69"/>
          <bitfield caption="Lock Region 70" mask="0x00000040" name="LOCK_REGION_70"/>
          <bitfield caption="Lock Region 71" mask="0x00000080" name="LOCK_REGION_71"/>
          <bitfield caption="Lock Region 72" mask="0x00000100" name="LOCK_REGION_72"/>
          <bitfield caption="Lock Region 73" mask="0x00000200" name="LOCK_REGION_73"/>
          <bitfield caption="Lock Region 74" mask="0x00000400" name="LOCK_REGION_74"/>
          <bitfield caption="Lock Region 75" mask="0x00000800" name="LOCK_REGION_75"/>
          <bitfield caption="Lock Region 76" mask="0x00001000" name="LOCK_REGION_76"/>
          <bitfield caption="Lock Region 77" mask="0x00002000" name="LOCK_REGION_77"/>
          <bitfield caption="Lock Region 78" mask="0x00004000" name="LOCK_REGION_78"/>
          <bitfield caption="Lock Region 79" mask="0x00008000" name="LOCK_REGION_79"/>
          <bitfield caption="Lock Region 80" mask="0x00010000" name="LOCK_REGION_80"/>
          <bitfield caption="Lock Region 81" mask="0x00020000" name="LOCK_REGION_81"/>
          <bitfield caption="Lock Region 82" mask="0x00040000" name="LOCK_REGION_82"/>
          <bitfield caption="Lock Region 83" mask="0x00080000" name="LOCK_REGION_83"/>
          <bitfield caption="Lock Region 84" mask="0x00100000" name="LOCK_REGION_84"/>
          <bitfield caption="Lock Region 85" mask="0x00200000" name="LOCK_REGION_85"/>
          <bitfield caption="Lock Region 86" mask="0x00400000" name="LOCK_REGION_86"/>
          <bitfield caption="Lock Region 87" mask="0x00800000" name="LOCK_REGION_87"/>
          <bitfield caption="Lock Region 88" mask="0x01000000" name="LOCK_REGION_88"/>
          <bitfield caption="Lock Region 89" mask="0x02000000" name="LOCK_REGION_89"/>
          <bitfield caption="Lock Region 90" mask="0x04000000" name="LOCK_REGION_90"/>
          <bitfield caption="Lock Region 91" mask="0x08000000" name="LOCK_REGION_91"/>
          <bitfield caption="Lock Region 92" mask="0x10000000" name="LOCK_REGION_92"/>
          <bitfield caption="Lock Region 93" mask="0x20000000" name="LOCK_REGION_93"/>
          <bitfield caption="Lock Region 94" mask="0x40000000" name="LOCK_REGION_94"/>
          <bitfield caption="Lock Region 95" mask="0x80000000" name="LOCK_REGION_95"/>
        </register>
        <register caption="Lock Bits Word 3" name="LOCKBIT_WORD3" offset="0xC" rw="RW" size="4">
          <bitfield caption="Lock Region 96" mask="0x00000001" name="LOCK_REGION_96"/>
          <bitfield caption="Lock Region 97" mask="0x00000002" name="LOCK_REGION_97"/>
          <bitfield caption="Lock Region 98" mask="0x00000004" name="LOCK_REGION_98"/>
          <bitfield caption="Lock Region 99" mask="0x00000008" name="LOCK_REGION_99"/>
          <bitfield caption="Lock Region 100" mask="0x00000010" name="LOCK_REGION_100"/>
          <bitfield caption="Lock Region 101" mask="0x00000020" name="LOCK_REGION_101"/>
          <bitfield caption="Lock Region 102" mask="0x00000040" name="LOCK_REGION_102"/>
          <bitfield caption="Lock Region 103" mask="0x00000080" name="LOCK_REGION_103"/>
          <bitfield caption="Lock Region 104" mask="0x00000100" name="LOCK_REGION_104"/>
          <bitfield caption="Lock Region 105" mask="0x00000200" name="LOCK_REGION_105"/>
          <bitfield caption="Lock Region 106" mask="0x00000400" name="LOCK_REGION_106"/>
          <bitfield caption="Lock Region 107" mask="0x00000800" name="LOCK_REGION_107"/>
          <bitfield caption="Lock Region 108" mask="0x00001000" name="LOCK_REGION_108"/>
          <bitfield caption="Lock Region 109" mask="0x00002000" name="LOCK_REGION_109"/>
          <bitfield caption="Lock Region 110" mask="0x00004000" name="LOCK_REGION_110"/>
          <bitfield caption="Lock Region 111" mask="0x00008000" name="LOCK_REGION_111"/>
          <bitfield caption="Lock Region 112" mask="0x00010000" name="LOCK_REGION_112"/>
          <bitfield caption="Lock Region 113" mask="0x00020000" name="LOCK_REGION_113"/>
          <bitfield caption="Lock Region 114" mask="0x00040000" name="LOCK_REGION_114"/>
          <bitfield caption="Lock Region 115" mask="0x00080000" name="LOCK_REGION_115"/>
          <bitfield caption="Lock Region 116" mask="0x00100000" name="LOCK_REGION_116"/>
          <bitfield caption="Lock Region 117" mask="0x00200000" name="LOCK_REGION_117"/>
          <bitfield caption="Lock Region 118" mask="0x00400000" name="LOCK_REGION_118"/>
          <bitfield caption="Lock Region 119" mask="0x00800000" name="LOCK_REGION_119"/>
          <bitfield caption="Lock Region 120" mask="0x01000000" name="LOCK_REGION_120"/>
          <bitfield caption="Lock Region 121" mask="0x02000000" name="LOCK_REGION_121"/>
          <bitfield caption="Lock Region 122" mask="0x04000000" name="LOCK_REGION_122"/>
          <bitfield caption="Lock Region 123" mask="0x08000000" name="LOCK_REGION_123"/>
          <bitfield caption="Lock Region 124" mask="0x10000000" name="LOCK_REGION_124"/>
          <bitfield caption="Lock Region 125" mask="0x20000000" name="LOCK_REGION_125"/>
          <bitfield caption="Lock Region 126" mask="0x40000000" name="LOCK_REGION_126"/>
          <bitfield caption="Lock Region 127" mask="0x80000000" name="LOCK_REGION_127"/>
        </register>
      </register-group>
    </module>
  </modules>
</avr-tools-device-file>
